export const treeNodeMap = {
  '0-0': '上皮型肿瘤',
  // 0-0-0
  '0-0-0': '上皮型肿瘤-腺癌',
  '0-0-0-5': '上皮型肿瘤-腺癌-浸润性粘液腺癌',
  '0-0-0-9': '上皮型肿瘤-腺癌-微小浸润性腺癌',
  '0-0-0-10': '上皮型肿瘤-腺癌-侵袭前病变',
  '0-0-0-10-1': '上皮型肿瘤-腺癌-侵袭前病变-原位腺癌',
  // 0-0-1
  '0-0-1': '上皮型肿瘤-鳞癌',
  '0-0-1-3': '上皮型肿瘤-鳞癌-侵袭前病变',
  // 0-1
  '0-1': '神经内分泌肿瘤',
  '0-1-0': '神经内分泌肿瘤-小细胞癌',
  '0-1-1': '神经内分泌肿瘤-大细胞神经内分泌癌',
  '0-1-2': '神经内分泌肿瘤-类癌肿瘤',
  '0-1-3': '神经内分泌肿瘤-侵袭前的病变',
  '0-1-6': '神经内分泌肿瘤-癌肉瘤样癌',
  '0-1-7': '神经内分泌肿瘤-其他未分类癌',
  '0-1-8': '神经内分泌肿瘤-唾液型肿瘤',
  '0-1-9': '神经内分泌肿瘤-乳头状瘤',
  '0-1-9-0': '神经内分泌肿瘤-乳头状瘤-鳞状细胞乳头状癌',
  '0-1-10': '神经内分泌肿瘤-腺瘤',
  // 0-2
  '0-2': '间叶性肿瘤',
  '0-2-2': '间叶性肿瘤-PEComatous肿瘤',
  '0-2-2-2': '间叶性肿瘤-PEComatous肿瘤-PEComa-恶性',
  '0-2-11': '间叶性肿瘤-肌上皮肿瘤',
  // 0-3
  '0-3': '异位肿瘤',
  '0-3-0': '异位肿瘤-生殖细胞肿瘤',
};

export const treeLeafMap = {
  // 0-0-0
  '0-0-0-0': '上皮型肿瘤-腺癌-贴壁型腺癌',
  '0-0-0-1': '上皮型肿瘤-腺癌-腺泡型腺癌',
  '0-0-0-2': '上皮型肿瘤-腺癌-乳头型腺癌',
  '0-0-0-3': '上皮型肿瘤-腺癌-微乳头型腺癌',
  '0-0-0-4': '上皮型肿瘤-腺癌-实体型腺癌',
  '0-0-0-5-0': '上皮型肿瘤-腺癌-浸润性粘液腺癌-浸润和非浸润性混合型粘液性腺癌',
  '0-0-0-6': '上皮型肿瘤-腺癌-胶质性腺癌',
  '0-0-0-7': '上皮型肿瘤-腺癌-胎儿型腺癌',
  '0-0-0-8': '上皮型肿瘤-腺癌-肠型腺癌',
  '0-0-0-9-0': '上皮型肿瘤-腺癌-微小浸润性腺癌-非粘液性腺癌',
  '0-0-0-9-1': '上皮型肿瘤-腺癌-微小浸润性腺癌-粘液癌',
  '0-0-0-10-0': '上皮型肿瘤-腺癌-侵袭前病变-非典型腺瘤样增生',
  '0-0-0-10-1-0': '上皮型肿瘤-腺癌-侵袭前病变-原位腺癌-非粘液性原位腺癌',
  '0-0-0-10-1-1': '上皮型肿瘤-腺癌-侵袭前病变-原位腺癌-粘液性原位腺癌',
  // 0-0-1
  '0-0-1-0': '上皮型肿瘤-鳞癌-角化型鳞癌',
  '0-0-1-1': '上皮型肿瘤-鳞癌-非角化型鳞癌',
  '0-0-1-2': '上皮型肿瘤-鳞癌-基底鳞状细胞癌',
  '0-0-1-3-0': '上皮型肿瘤-鳞癌-侵袭前病变-鳞状细胞原位癌',
  // 0-1
  '0-1-0-0': '神经内分泌肿瘤-小细胞癌-结合小细胞癌',
  '0-1-1-0': '神经内分泌肿瘤-大细胞神经内分泌癌-结合大细胞神经内分泌癌',
  '0-1-2-0': '神经内分泌肿瘤-类癌肿瘤-典型类癌肿瘤',
  '0-1-2-1': '神经内分泌肿瘤-类癌肿瘤-非典型类癌肿瘤',
  '0-1-3-0': '神经内分泌肿瘤-侵袭前的病变-弥漫性特发性肺神经内分泌细胞增生',
  '0-1-4': '神经内分泌肿瘤-大细胞癌',
  '0-1-5': '神经内分泌肿瘤-腺鳞癌',
  '0-1-6-0': '神经内分泌肿瘤-癌肉瘤样癌-多形性癌',
  '0-1-6-1': '神经内分泌肿瘤-癌肉瘤样癌-梭形细胞癌',
  '0-1-6-2': '神经内分泌肿瘤-癌肉瘤样癌-巨细胞癌',
  '0-1-6-3': '神经内分泌肿瘤-癌肉瘤样癌-癌肉瘤',
  '0-1-6-4': '神经内分泌肿瘤-癌肉瘤样癌-肺胚细胞瘤',
  '0-1-7-0': '神经内分泌肿瘤-其他未分类癌-淋巴上皮样癌',
  '0-1-7-1': '神经内分泌肿瘤-其他未分类癌-NUT肿瘤',
  '0-1-8-0': '神经内分泌肿瘤-唾液型肿瘤-粘液表皮样癌肿瘤',
  '0-1-8-1': '神经内分泌肿瘤-唾液型肿瘤-腺样囊性癌',
  '0-1-8-2': '神经内分泌肿瘤-唾液型肿瘤-上皮-肌上皮癌',
  '0-1-8-3': '神经内分泌肿瘤-唾液型肿瘤-多形性腺瘤',
  '0-1-9-0-0': '神经内分泌肿瘤-乳头状瘤-鳞状细胞乳头状癌-外生型',
  '0-1-9-0-1': '神经内分泌肿瘤-乳头状瘤-鳞状细胞乳头状癌-逆向生长',
  '0-1-9-1': '神经内分泌肿瘤-乳头状瘤-腺型状瘤',
  '0-1-9-2': '神经内分泌肿瘤-乳头状瘤-腺鳞混合型乳头状瘤',
  '0-1-10-0': '神经内分泌肿瘤-腺瘤-良性硬化性肺细胞瘤',
  '0-1-10-1': '神经内分泌肿瘤-腺瘤-泡腺腺瘤',
  '0-1-10-2': '神经内分泌肿瘤-腺瘤-乳头状腺瘤',
  '0-1-10-3': '神经内分泌肿瘤-腺瘤-粘液性囊腺瘤腺瘤',
  '0-1-10-4': '神经内分泌肿瘤-腺瘤-粘液腺腺瘤',
  // 0-2
  '0-2-0': '间叶性肿瘤-肺错构瘤',
  '0-2-1': '间叶性肿瘤-软骨瘤',
  '0-2-2-0': '间叶性肿瘤-PEComatous肿瘤-淋巴管平滑肌瘤病',
  '0-2-2-1-0': '间叶性肿瘤-PEComatous肿瘤-PEComa-良性-透明细胞瘤',
  '0-2-3': '间叶性肿瘤-先天性支气管周肌纤维母细胞肿瘤',
  '0-2-4': '间叶性肿瘤-弥漫性肺淋巴管瘤病',
  '0-2-5': '间叶性肿瘤-炎症性肌纤维母细胞瘤',
  '0-2-6': '间叶性肿瘤-上皮样血管内皮瘤',
  '0-2-7': '间叶性肿瘤-胸膜肺母细胞瘤',
  '0-2-8': '间叶性肿瘤-滑膜肉瘤',
  '0-2-9': '间叶性肿瘤-肺动脉内膜肉瘤',
  '0-2-10': '间叶性肿瘤-肺黏液肉瘤伴EWSR1-CREB1易位',
  '0-2-11-0': '间叶性肿瘤-肌上皮肿瘤-肌上皮瘤',
  '0-2-11-1': '间叶性肿瘤-肌上皮肿瘤-肌上皮癌',
  '0-2-12': '间叶性肿瘤-淋巴细胞组织细胞肿瘤',
  '0-2-13': '间叶性肿瘤-结外边缘区黏膜相关淋巴组织淋巴瘤（MALT淋巴瘤）',
  '0-2-14': '间叶性肿瘤-弥漫性大细胞淋巴瘤',
  '0-2-15': '间叶性肿瘤-淋巴瘤样肉芽肿',
  '0-2-16': '间叶性肿瘤-血管内大B细胞淋巴瘤',
  '0-2-17': '间叶性肿瘤-肺朗格罕细胞组织细胞增生症',
  '0-2-18': '间叶性肿瘤-Erdheim-Chester病',
  // 0-3
  '0-3-0-0': '异位肿瘤-生殖细胞肿瘤-畸胎瘤-成熟',
  '0-3-0-1': '异位肿瘤-生殖细胞肿瘤-畸胎瘤-不成熟',
  '0-3-1': '异位肿瘤-肺内的胸腺瘤',
  '0-3-2': '异位肿瘤-黑色素瘤',
  '0-3-3': '异位肿瘤-脑膜瘤',
  // 0-4
  '0-4': '转移性肿瘤',
  // 0-5
  '0-5': '其他',
};

/**
 * @description: 删除重复的母亲节点
 * @Param:
 */
export const DelDuplicateNodes = (PatDiaStr: string) => {
  // console.log('PatDiaStr', PatDiaStr);
  if (!PatDiaStr || PatDiaStr === '-' || PatDiaStr.length === 0) return '-';

  const patDiaList = PatDiaStr.split(',');
  let res = '';
  for (const item of patDiaList) {
    // console.log('item', item);
    // 判断是否为叶子节点
    if (item !== '0-5') {
      if (treeLeafMap.hasOwnProperty(item)) {
        res += `${treeLeafMap[item]},`;
      } else if (treeNodeMap.hasOwnProperty(item)) {
        // 判断是否为父亲节点
        // console.log('判断是否为父亲节点 item', item);
        let needRemove = 0;
        // 遍历 patDiaList
        for (const _item of patDiaList) {
          if (_item.search(item) !== -1) {
            needRemove += 1;
          }
        }
        if (needRemove <= 1) {
          res += `${treeNodeMap[item]}，`;
        }
      }
    }
  }
  // console.log('res', res);
  return res.slice(0, res.length - 1);
};
